In [1]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [5]:
s1 = Series([0,1,2],index = ["A","B","C"])
s1

A    0
B    1
C    2
dtype: int64

In [7]:
s2 = Series([3,4,5,6],index = ["A","B","C","D"])
s2

A    3
B    4
C    5
D    6
dtype: int64

In [9]:
s1 + s2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [11]:
df1 = DataFrame(np.arange(4).reshape((2,2)),columns = list("AB"),index = ["NYC","LA"])
df1

     A  B
NYC  0  1
LA   2  3

In [15]:
df2 = DataFrame(np.arange(9).reshape((3,3)),columns = list("ADC"),index = ["NYC","SF","LA"])
df2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [17]:
df1 + df2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [19]:
df1.add(df2,fill_value = 0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [21]:
s3 = df2.iloc[0]
s3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [23]:
df2 - s3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

In [25]:
df2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8